/**********************************************************************************
// Maze (Arquivo de Cabeçalho)
//
// Criação:     01 Jan 2013
// Atualização: 25 Ago 2021
// Compilador:  Visual C++ 2019
//
// Descrição:   Executor do Maze
//
**********************************************************************************/

#ifndef _MAZE_H_
#define _MAZE_H_

// ------------------------------------------------------------------------------

enum MazeObjects
{
	PLAYER,
	GHOST,
	GHOST_VISION,
	SPAWNER,
	POWER_UP,
	WALL
};

// ------------------------------------------------------------------------------

#endif
